#coding: utf-8 -*-
import readline

text = raw_input('Input Persian Text: ')

MyList = [
('َ', 'a'),
('ِ', 'e'),
('ُ', 'o'),
('ء','\''),
('أ','\''),
('ئ','\''),
('ؤ','\''),
('ا','â'),('آ','â'),('اَ','a'),('اَِ','e'),('اُ','o'),#problem
('ب','b'),
('پ','p'),
('ت','t'),
('ث','s'),
('ج','dž'),
('چ','č'),
('ح','h'),
('خ','kh'),
('د','d'),
('ذ','z'),
('ر','r'),
('ز','z'),
('ژ','ž'),
('س','s'),
('ش','š'),
('ص','s'),
('ض','z'),
('ط','t'),
('ظ','z'),
('ع','\''),
('عَ','\'a'),#problem
('غ','g'),
('ف','f'),
('ق','q'),
('ک','k'),
('گ','g'),
('ل','l'),
('م','m'),
('ن','n'),
('و','w'),
('ه','h'),
('ی','ye'),
('ي','i'),
('۰','0'),('۱','1'),('۲','2'),('۳','3'),('۴','4'),
('۵','5'),('۶','6'),('۷','7'),('۸','8'),('۹','9'),
('thâm','tâm'),
('eh','e'),
('âw','u'),
('ye','i'),(' i ',' ye '),#('i ','ye '),
('؟','?'),
('ow','ō'),
('rw','ru'),
('mh','me'),
('rh','re'),
('bh','be'),
('dh','de'),
('zh','ze'),
('th','te'),
('nh','ne'),
('kew','khu'),('kea','kha'),('key','khiy'),('khwâ','khâ'),
('âa','a'),
('âe','e'),
('âi','i'),
('iâ','yâ'),
('ie','âye'),
('w','u'),(' u ',' va '),
('uie','uye'),
('uâ','u'),
('khuh','khâh')
]

for k,v in MyList:
    text = text.replace(k, v)

print ("\n\n\n"), text
